Revit 2024 API
ParameterTypeId.DimStyleAngularUnits Property
 "Units Format"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId DimStyleAngularUnits { get; }
Visual Basic
Public Shared ReadOnly Property DimStyleAngularUnits As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ DimStyleAngularUnits {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace